Факторы сложности 
==================

 Фактор 1. Большая длительность проекта
---------------------------------------

### Параметры оценки фактора сложности

| **№ пп** | **Параметр оценки сложности**                                                      | **Низкая сложность**        | **Средняя сложность**        | **Высокая сложность**        |
|          |                                                                                    | **"0"**                     | **"1"**                      | **"2"**                      |
|----------|------------------------------------------------------------------------------------|-----------------------------|------------------------------|------------------------------|
| 1.       | Общая длительность проекта, от даты подписания Устава/Паспорта до закрытия проекта | до 12 мес.                  | 12-24 мес.                   | более 24 мес.                |

### Проблемы, порождаемые фактором сложности 

| **№ пп** | **Проблема**                                                                                                             | **Комментарий**                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      |
|----------|--------------------------------------------------------------------------------------------------------------------------|--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
|          | **Уменьшение интереса к проекту со стороны заинтересованных сторон**                                                     | Чем дольше идет проект, тем больше изменений происходит в деятельности заинтересованных сторон (ЗС). Ситуация может измениться настолько, что отпадет сама необходимость в проекте                                                                                                                                                                                                                                                                                                                                                   |
|          | **Изменение за период реализации проекта персонального состава ключевых лиц, принимающих решения по проекту**            | Согласно [исследованию компании SuperJob](https://www.superjob.ru/research/articles/111767/dolshe-vsego-na-odnom-meste-rabotayut-medsestry-i-uchitelya/) средний стаж работы менеджеров по развитию около 2,5 лет. Согласно [исследованию онлайн сервиса Profgallery](https://www.osp.ru/cio/2016/10/13051203/) большая часть руководителей работает в компании 2-3 года. Смена ключевых лиц, принимающих решения, означает необходимость их включения в работу, налаживания коммуникаций и возможное изменение требований к проекту |
|          | **Падение мотивации команды**                                                                                            | Длительная работа на проекте может привести к потере веры в конечный успех, усталости и выгоранию                                                                                                                                                                                                                                                                                                                                                                                                                                    |
|          | **Увольнение ключевых сотрудников, ввод новых участников проекта**                                                       | Согласно вышеуказанному исследованию SuperJob среднее время работы на одном месте сотрудников инженерных специальностей около 3-х лет, программистов около 2,5 лет. Изменения в команде несут серьезные риски для проекта                                                                                                                                                                                                                                                                                                            |
|          | **При большой длительности проекта в компании проходят процедуры пересмотра портфеля проектов, бюджетных корректировок** | Процессы пересмотра портфеля и бюджетов могут серьезно повлиять на цели, бюджет проекта или связанные мероприятия. При этом данные изменения могут рассматриваться и как риск (получить непредусмотренные существенные изменения проекта) и как возможность (внести назревшие изменения).                                                                                                                                                                                                                                            |

### Управленческие задачи по решению порождаемых проблем

1.  Организовать регулярную работу по управлению вовлечением и ожиданиями
    ключевых заинтересованных сторон.

2.  Создать и поддерживать команду, нацеленную на долговременную продуктивную
    работу.

3.  Выстроить систему управления, меняющуюся в соответствии с жизненным циклом
    проекта, включающую точки принятия ключевых решений.

4.  Выстроить систему управления знаниями в проекте, включающую долговременное и
    безопасное хранение документов и материалов проекта

**Общие активности для всех задач**

-   планирование проекта, исходя из итеративного получения результата, с
    регулярной демонстрацией промежуточных результатов заинтересованным
    сторонам.

**Разработка в обязательном порядке следующих документов:**

-   План управления проектом (Регламент управления проектом);

-   Матрица заинтересованных сторон (Влияние/вовлеченность)

-   Журнал вопросов и проблем;

-   Реестр изменений.

#### Задача 1.1.

**Способен организовать регулярную работу по управлению вовлечением и ожиданиями
ключевых заинтересованных сторон**

**Потенциальные активности:**

-   постоянные личные встречи руководителя проекта с заинтересованными
    сторонами. Рекомендуется учесть модель эффективности различных каналов
    коммуникаций (СО 1.1);

-   ведение количественных показателей (метрик) удовлетворенности по
    заинтересованным сторонам. Рекомендуемая методика: Качественный анализ
    лояльности стейкхолдеров QLASs компании PM Expert (СО 1.2);

-   определение особенностей каждой организации с точки зрения информационных
    потоков, определение контактных лиц от организаций и форм взаимодействия с
    ними, исходя из этих особенностей. Рекомендуемые модели: Закон Конвея (СО
